app/views/gossips/show.html.erb

<br><br><h1>Bienvenue sur la page du gossip n° <%= @gossip.id %></h1><br><br>
<h3>Il a été écrit par : <%= @gossip.user.first_name %> --> <a <%= link_to "Page de " +@gossip.user.first_name, show_user_path(:id => @gossip.user_id) %> </a></h3>
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 41], ["LIMIT", 1]]