app/views/welcome/index.html.erb


<% Gossip.all.each do |gossip| %>
---
SELECT "gossips".* FROM "gossips"

  <div class="card-header">
    <%=  gossip.user.first_name%>
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]