app/controllers/cities_controller.rb

def show
	@city = City.find(params[:id])
---
SELECT  "cities".* FROM "cities" WHERE "cities"."id" = $1 LIMIT $2  [["id", 47], ["LIMIT", 1]]