app/controllers/gossips_controller.rb

SELECT  "gossips".* FROM "gossips" WHERE "gossips"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]
---
	def show
		@gossip = Gossip.find(params[:id])

INSERT INTO "gossips" ("title", "content", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "coucou"], ["content", "coucou"], ["user_id", 42], ["created_at", "2019-10-31 23:46:55.581979"], ["updated_at", "2019-10-31 23:46:55.581979"]]
---
	def create


		@gossip = Gossip.new
		@gossip.title = params[:title]
		@gossip.content = params[:content]
		@gossip.user = current_user
		@gossip.save

SELECT  "gossips".* FROM "gossips" WHERE "gossips"."id" = $1 LIMIT $2  [["id", 11], ["LIMIT", 1]]
---
def edit
	@gossip = Gossip.find(params[:id])

SELECT  "gossips".* FROM "gossips" WHERE "gossips"."id" = $1 LIMIT $2  [["id", 11], ["LIMIT", 1]]
UPDATE "gossips" SET "title" = $1, "updated_at" = $2 WHERE "gossips"."id" = $3  [["title", "hello"], ["updated_at", "2019-10-31 23:47:06.180397"], ["id", 11]]
---
def update
  @gossip = Gossip.find(params[:id])
	gossip_params = params.require(:gossip).permit(:title, :content)
	if @gossip.update(gossip_params)

SELECT  "gossips".* FROM "gossips" WHERE "gossips"."id" = $1 LIMIT $2  [["id", 11], ["LIMIT", 1]]
DELETE FROM "gossips" WHERE "gossips"."id" = $1  [["id", 11]]
---
	def destroy
		@gossip = Gossip.find(params[:id])
		@gossip.destroy

SELECT  "gossips".* FROM "gossips" WHERE "gossips"."id" = $1 LIMIT $2  [["id", 11], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 42], ["LIMIT", 1]]
---
	def right_user
    @gossip=Gossip.find(params[:id])
    @user=User.find(@gossip.user_id)