app/controllers/users_controller.rb

def show

		@user = User.find(params[:id])
  	@city = City.find(params[:id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 41], ["LIMIT", 1]]
SELECT  "cities".* FROM "cities" WHERE "cities"."id" = $1 LIMIT $2  [["id", 41], ["LIMIT", 1]]

	def create
		city = City.first
		puts "ok"
		@user = User.new(first_name: params[:first_name],
   email: params[:email], password: params[:password], city_id: city.id)
		puts "ok"

		if @user.save
---
SELECT  "cities".* FROM "cities" ORDER BY "cities"."id" ASC LIMIT $1  [["LIMIT", 1]]
INSERT INTO "users" ("first_name", "email", "city_id", "created_at", "updated_at", "password_digest") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"